In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../data/train.csv')
print(df.shape)
df.head()

(76518, 38)

,id,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,0,1,1,1,9238,1,1,126.0,1,1,...,0,6,7,6,12.428571,0,11.1,0.6,2.02,Graduate
1,1,1,17,1,9238,1,1,125.0,1,19,...,0,6,9,0,0.000000,0,11.1,0.6,2.02,Dropout
2,2,1,17,2,9254,1,1,137.0,1,3,...,0,6,0,0,0.000000,0,16.2,0.3,-0.92,Dropout
3,3,1,1,3,9500,1,1,131.0,1,19,...,0,8,11,7,12.820000,0,11.1,0.6,2.02,Enrolled
4,4,1,1,2,9500,1,1,132.0,1,19,...,0,7,12,6,12.933333,0,7.6,2.6,0.32,Graduate

In [3]:
df.columns = df.columns.str.lower().str.replace(' ', '_').str.replace('.', '')

df.columns #Phew, found the original website.

Index(['id', 'marital_status', 'application_mode', 'application_order',
       'course', 'daytime/evening_attendance', 'previous_qualification',
       'previous_qualification_(grade)', 'nacionality',
       'mother's_qualification', 'father's_qualification',
       'mother's_occupation', 'father's_occupation', 'admission_grade',
       'displaced', 'educational_special_needs', 'debtor',
       'tuition_fees_up_to_date', 'gender', 'scholarship_holder',
       'age_at_enrollment', 'international',
       'curricular_units_1st_sem_(credited)',
       'curricular_units_1st_sem_(enrolled)',
       'curricular_units_1st_sem_(evaluations)',
       'curricular_units_1st_sem_(approved)',
       'curricular_units_1st_sem_(grade)',
       'curricular_units_1st_sem_(without_evaluations)',
       'curricular_units_2nd_sem_(credited)',
       'curricular_units_2nd_sem_(enrolled)',
       'curricular_units_2nd_sem_(evaluations)',
       'curricular_units_2nd_sem_(approved)',
       'curricular_units_2nd_sem_(grade)',
       'curricular_units_2nd_sem_(without_evaluations)', 'unemployment_rate',
       'inflation_rate', 'gdp', 'target'],
      dtype='object')

In [4]:
for i in df.columns:
    if df[i].dtypes == 'object':
        print(f"{i} is actually an object.")

target is actually an object.

Hmm, so everything else looks like it'll be some numeric value (inc. booleans). That will make things easier. Reminder to when we're cleaning up the data to convert target to a numeric representation.

In [5]:
exceptions = ['id']

for i in df.columns:
    if len(df[i].unique()) == df.shape[0] and i not in exceptions:
        df = df.drop([i], axis=1) #Not adding anything to our model... Hmm, now that I think about it, let's make this better:
        print(f"Just dropped {i} as it wasn't adding any value whatsoever to our model.")
    else:
        print(f"Well, {i} has {len(df[i].unique())} unique fields, so we'll keep it...for now!")

Well, id has 76518 unique fields, so we'll keep it...for now!
Well, marital_status has 6 unique fields, so we'll keep it...for now!
Well, application_mode has 22 unique fields, so we'll keep it...for now!
Well, application_order has 8 unique fields, so we'll keep it...for now!
Well, course has 19 unique fields, so we'll keep it...for now!
Well, daytime/evening_attendance has 2 unique fields, so we'll keep it...for now!
Well, previous_qualification has 21 unique fields, so we'll keep it...for now!
Well, previous_qualification_(grade) has 110 unique fields, so we'll keep it...for now!
Well, nacionality has 18 unique fields, so we'll keep it...for now!
Well, mother's_qualification has 35 unique fields, so we'll keep it...for now!
Well, father's_qualification has 39 unique fields, so we'll keep it...for now!
Well, mother's_occupation has 40 unique fields, so we'll keep it...for now!
Well, father's_occupation has 56 unique fields, so we'll keep it...for now!
Well, admission_grade has 668 unique fields, so we'll keep it...for now!
Well, displaced has 2 unique fields, so we'll keep it...for now!
Well, educational_special_needs has 2 unique fields, so we'll keep it...for now!
Well, debtor has 2 unique fields, so we'll keep it...for now!
Well, tuition_fees_up_to_date has 2 unique fields, so we'll keep it...for now!
Well, gender has 2 unique fields, so we'll keep it...for now!
Well, scholarship_holder has 2 unique fields, so we'll keep it...for now!
Well, age_at_enrollment has 46 unique fields, so we'll keep it...for now!
Well, international has 2 unique fields, so we'll keep it...for now!
Well, curricular_units_1st_sem_(credited) has 21 unique fields, so we'll keep it...for now!
Well, curricular_units_1st_sem_(enrolled) has 24 unique fields, so we'll keep it...for now!
Well, curricular_units_1st_sem_(evaluations) has 36 unique fields, so we'll keep it...for now!
Well, curricular_units_1st_sem_(approved) has 23 unique fields, so we'll keep it...for now!
Well, curricular_units_1st_sem_(grade) has 1206 unique fields, so we'll keep it...for now!
Well, curricular_units_1st_sem_(without_evaluations) has 12 unique fields, so we'll keep it...for now!
Well, curricular_units_2nd_sem_(credited) has 20 unique fields, so we'll keep it...for now!
Well, curricular_units_2nd_sem_(enrolled) has 22 unique fields, so we'll keep it...for now!
Well, curricular_units_2nd_sem_(evaluations) has 31 unique fields, so we'll keep it...for now!
Well, curricular_units_2nd_sem_(approved) has 21 unique fields, so we'll keep it...for now!
Well, curricular_units_2nd_sem_(grade) has 1234 unique fields, so we'll keep it...for now!
Well, curricular_units_2nd_sem_(without_evaluations) has 11 unique fields, so we'll keep it...for now!
Well, unemployment_rate has 11 unique fields, so we'll keep it...for now!
Well, inflation_rate has 13 unique fields, so we'll keep it...for now!
Well, gdp has 11 unique fields, so we'll keep it...for now!
Well, target has 3 unique fields, so we'll keep it...for now!

Decent amount of unique fields for each one. Recall that we have 76k data points to work it, so expecting/hoping to see overwhelmingmajority of them to have recent representation.

In [6]:
if sum(df.isnull().sum())==0:
    print("Phew, no nulls.")
else:
    print(df.columns[df.isnull().any()]) #Should be done with general stuff. Onto individualized eda. Starting with our targe.

Phew, no nulls.

In [7]:
df['target'].value_counts() #Hmm, quite a lot of enrolled. Guess the 'data' was meant to just see if we can distinguish the
#various possibilities. Iemor likely to be single...

#Of note also is the vast amount of dropouts.... perhaps snythetic but still... what kind of school is this?!!?

target
Graduate    36282
Dropout     25296
Enrolled    14940
Name: count, dtype: int64

In [8]:
i = 1

In [9]:
# df.iloc[:, i:i+5].apply(pd.Series.value_counts) #Eh, when all over like with course won' work out...
#Off hand I suppose I'll neeed to look at these somwhat individually; well, perhaps I can go through and parse them to see
#what's categorical and look at those in a similar manner. So too with whatever other similar types...

#Unfortunately I don't see a quick way to group them. So, I'll leave that idea on the backbuner for now and manaully
#go through them.

In [24]:
print(df[df.columns[i]].value_counts(normalize=True))
# df.groupby(df.columns[i])['target'].describe()
df.groupby(df.columns[i])['target'].agg(['describe', 'value_counts'])[:12]

marital_status
1    0.917287
2    0.069212
4    0.011318
5    0.001516
6    0.000457
3    0.000209
Name: proportion, dtype: float64

              describe                         value_counts
                 count unique       top   freq        count
1                70189      3  Graduate  34427          NaN
2                 5296      3   Dropout   2968          NaN
3                   16      3  Graduate      7          NaN
4                  866      3   Dropout    509          NaN
5                  116      3   Dropout     63          NaN
6                   35      3   Dropout     23          NaN
(1, Graduate)      NaN    NaN       NaN    NaN      34427.0
(1, Dropout)       NaN    NaN       NaN    NaN      21726.0
(1, Enrolled)      NaN    NaN       NaN    NaN      14036.0
(2, Dropout)       NaN    NaN       NaN    NaN       2968.0
(2, Graduate)      NaN    NaN       NaN    NaN       1593.0
(2, Enrolled)      NaN    NaN       NaN    NaN        735.0

 Single, married, then a variety of others. Pragmatically could simplify 3-6 as representing atypical 'marital' situations.
 Of interest are the larger groups (as fundamentally I'm discinclined to subscribe significance to any of the smaller groups by default, save a very significant percentage in one direction ie 90% of widows graduate. However, all that is just intuition).: Unsurprising, well at least hopefully, the majority of single people will graduate - as pragmatically they have more time available to focus on their studies and the like. On the other hand, it's quite interesting yet unsurprising to see a majority of the married people drop out - as likely they dropped out to get married. It would be interesting to see their subsequent 'role' upon marriage - ie are they going to be domestics? Are they entering into their spouse's or family's business?

In [42]:
i = 2
print(df[df.columns[i]].value_counts(normalize=True)[:6])
#Unfortunately I wasn't sure how to arrange the groupby frequency. So, chatgpt to the rescue... I'll take pride in at least
#simplifying the lines into two.
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]
#Limiting to 6 for my eyes' sake.

application_mode
1     0.460375
17    0.215936
39    0.189746
44    0.039363
43    0.034907
7     0.019577
Name: proportion, dtype: float64

                  count unique       top   freq
application_mode
1                 35227      3  Graduate  21510
17                16523      3  Graduate   8174
39                14519      3   Dropout   9725
44                 3012      3  Graduate   1219
43                 2671      3   Dropout   1088
7                  1498      3   Dropout   1081

On a quick analysis of the top 6 mehods, it seems that the inclination from gaduate to dropout is tenuous at best. The details of each application type are quite complicated, but the first two are general contingent 1st and second phase (likely fall and spring semesters). Ie regular applications. Of interest though is the decently larger percentage of graduates that started in the fall, which I'd argue is more normal (right after the previous 'year' of whatever they were doing, signifying a greater level of completion and tranquility of mind).

In [44]:
i = 3
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

print(df[df[df.columns[3]]==0].shape[0]/df.shape[0])

application_order
1    0.710696
2    0.115986
3    0.070101
4    0.049949
5    0.027771
6    0.025445
Name: proportion, dtype: float64

                   count unique       top   freq
application_order
1                  54381      3  Graduate  23349
2                   8875      3  Graduate   4777
3                   5364      3  Graduate   3303
4                   3822      3  Graduate   2487
5                   2125      3  Graduate    976
6                   1947      3  Graduate   1389

Hmmm...  this is quite interesting. Obviously people generally will go, given accepted, to their higher choice.Yet, per the data dictionary apparently a 0 is actually the fist choice... uh.... given 70% of the data is for '1' I think that's a mistake and likely it's an other category... I just refuse to accept a paltry basically 0 percent...

Regardless, I find it interesting that although the plurality of each of the application orders graduate {albeit talking abou the top 6 and note that I'll often refer to matters in that short hand...}. However, 1's not the majority (while the others, save 5, are the majority). Perhaps makes you wonder if they're going on a 'grass is greener...' type of mindset, as opposed to the others' that did not go to their initialy desired school for whatever reason.

In [51]:
i = 4
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

course
9500    0.157793
9773    0.107347
9238    0.103701
9147    0.101166
9254    0.070898
9085    0.070219
Name: proportion, dtype: float64

        count unique       top  freq
course
9500    12074      3  Graduate  9325
9773     8214      3  Graduate  5586
9238     7935      3  Graduate  5277
9147     7741      3  Enrolled  2976
9254     5425      3  Graduate  2029
9085     5373      3  Graduate  2266

Pretty evenly spread. Of note is the vast range in topics, likely reflecting the diffeences of people in each one.

In [55]:
i = 5
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

daytime/evening_attendance
1    0.915314
0    0.084686
Name: proportion, dtype: float64

                            count unique       top   freq
daytime/evening_attendance
1                           70038      3  Graduate  34257
0                            6480      3   Dropout   3443

1 is daytime attendance. Now, I'm unsure about the fulltime factor which might be related (ie resouces available). Regardless, people ar generally more focused during the day, being diurnal mammals. Hence,more likely to get their goals done of graduating.

In [56]:
i = 6
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

previous_qualification
1     0.878003
19    0.038514
39    0.038266
3     0.018309
12    0.011749
9     0.004025
Name: proportion, dtype: float64

                        count unique       top   freq
previous_qualification
1                       67183      3  Graduate  33757
19                       2947      3   Dropout   2158
39                       2928      3  Graduate   1180
3                        1401      3   Dropout   1042
12                        899      3   Dropout    758
9                         308      3   Dropout    296

1 is seconday education, so for us in the US high school. Unsurprising that cohort is the greatest nor with graduates being the top (barely a majority) as they are going for at least SOME higher education and have the base knowledge and skillset to be expected to succuedd (sp?).

In [60]:
i = 7
print(df[df.columns[i]].value_counts(normalize=True))
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index]

previous_qualification_(grade)
133.1    0.140085
130.0    0.081824
140.0    0.077328
120.0    0.058953
125.0    0.035926
           ...
140.6    0.000013
162.9    0.000013
119.3    0.000013
173.0    0.000013
138.4    0.000013
Name: proportion, Length: 110, dtype: float64

                                count unique       top  freq
previous_qualification_(grade)
133.1                           10719      3   Dropout  7126
130.0                            6261      3  Graduate  2535
140.0                            5917      3  Graduate  2370
120.0                            4511      3   Dropout  2027
125.0                            2749      3  Graduate  1385
...                               ...    ...       ...   ...
171.0                               1      1   Dropout     1
140.6                               1      1   Dropout     1
145.9                               1      1  Graduate     1
148.8                               1      1  Graduate     1
190.0                               1      1   Dropout     1

[110 rows x 4 columns]

Previous qualification (grade). Unsure about this... ie bigger is better seemingly.

Truthfully would like to look into this one better, but CBA that right now. Regardless, note the assumed fallacy of 'smarter people' being more likely to graduate as besides whatever personal issues, those related or not to their intelligence, likely they are choosing more difficult courses such that their completion rates average at with their 'less bright' peers. I recall the abysmal pass rates from my actuarial days...

In [65]:
i = 8
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

nacionality
1     0.993400
41    0.002888
26    0.000876
6     0.000732
22    0.000732
24    0.000196
Name: proportion, dtype: float64

             count unique       top   freq
nacionality
1            76013      3  Graduate  36040
41             221      3   Dropout     95
26              67      3  Graduate     36
22              56      3  Graduate     35
6               56      3   Dropout     22
11              15      2  Graduate     14

Just noticed - spelling error? Regardless,likely fitting as this is clearly from some Portuguese institution per the distribution of people. Hence, likely why tourism is higher as I'd assume it'd be in the US (re.the courses earlier, 9500, the top course). Regardless, a bit hard to interpret the rest as they're small in count. However, I'd assume by default more dropouts as they have the lack of stability of being in a foreign country (more likely than not) and potential langauge and cultural barriers.

In [66]:
i = 9
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

mother's_qualification
1     0.264016
19    0.248046
37    0.243916
38    0.118390
3     0.076975
34    0.026046
Name: proportion, dtype: float64

                        count unique       top   freq
mother's_qualification
1                       20202      3  Graduate  10699
19                      18980      3  Graduate   9411
37                      18664      3   Dropout   7981
38                       9059      3  Graduate   5401
3                        5890      3  Graduate   2591
34                       1993      3   Dropout   1709

Assume by default a similar analysis to father.

Of interest are the years the data was gathered, as if this factor is significant than cultural changes as time goes on would make this factor particularly malleable. It was 'donated on 12/12/21' (original data that this was based upon).

In [67]:
i = 10
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

father's_qualification
37    0.304373
19    0.248504
1     0.203926
38    0.160132
3     0.039350
34    0.023393
Name: proportion, dtype: float64

                        count unique       top  freq
father's_qualification
37                      23290      3  Graduate  9794
19                      19015      3  Graduate  9730
1                       15604      3  Graduate  7521
38                      12253      3  Graduate  7225
3                        3011      3  Graduate  1257
34                       1790      3   Dropout  1550

Hmm.... this count be a fun new variable to make - whose parent is more educated, as by the fathers' 1 and 37, albeit both still in the top 3, are exchanges. Ie so for most of the people (assuming the parents' educations are independent) the women are more educated than the man.

Going on from this would be the factor of the child then - ie a male child in such a famly - is he more likely to emulate his father or his mother? Versus a female child in that same situation.

In [68]:
i = 11
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

mother's_occupation
9    0.423247
4    0.209911
5    0.123526
3    0.060692
7    0.054981
2    0.053412
Name: proportion, dtype: float64

                     count unique       top   freq
mother's_occupation
9                    32386      3  Graduate  15511
4                    16062      3  Graduate   8108
5                     9452      3  Graduate   4873
3                     4644      3  Graduate   2391
7                     4207      3  Graduate   2148
2                     4087      3  Graduate   1695

Unskilled,admin, and personal. Interesting seeing the interaction with the pevious column as those professions don't seem to me to be so neccsary to have education.

In [69]:
i = 12
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

father's_occupation
9    0.291696
7    0.168718
5    0.126258
4    0.087143
3    0.074009
8    0.066795
Name: proportion, dtype: float64

                     count unique       top   freq
father's_occupation
9                    22320      3  Graduate  10690
7                    12910      3  Graduate   7035
5                     9661      3  Graduate   4626
4                     6668      3  Graduate   2972
3                     5663      3  Graduate   2967
8                     5111      3  Graduate   2763

A bit more ndustry workers and installaton (9 and 8). Both in line with general population and default gender assumptions.

In [71]:
i = 13
print(df[df.columns[i]].value_counts(normalize=True))
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index]

admission_grade
120.0    0.039141
130.0    0.035338
140.0    0.034280
100.0    0.021995
110.0    0.019368
           ...
149.1    0.000013
164.7    0.000013
111.2    0.000013
178.6    0.000013
165.9    0.000013
Name: proportion, Length: 668, dtype: float64

                count unique       top  freq
admission_grade
120.0            2995      3   Dropout  1895
130.0            2704      3   Dropout  1385
140.0            2623      3   Dropout  1229
100.0            1683      3   Dropout  1014
110.0            1482      3   Dropout   837
...               ...    ...       ...   ...
166.7               1      1   Dropout     1
159.6               1      1   Dropout     1
161.4               1      1   Dropout     1
160.3               1      1  Graduate     1
98.4                1      1  Enrolled     1

[668 rows x 4 columns]

Would be interested in seeing the difference/correlation between this and the previous grad. Also, note here the greater range of the top 5, lesser frequency the top 5 has, and that the top 5 are all 'occupied' by dropouts.

In [72]:
i = 14
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

displaced
1    0.569265
0    0.430735
Name: proportion, dtype: float64

           count unique       top   freq
displaced
1          43559      3  Graduate  23154
0          32959      3   Dropout  13431

Unsure what is meant here. 1 is yes and I found it intereting that displaced are more likely to graduate - consider what we rationalized earlier. Hence, the need for empiricism!

In [73]:
i = 15
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

educational_special_needs
0    0.996262
1    0.003738
Name: proportion, dtype: float64

                           count unique       top   freq
educational_special_needs
0                          76232      3  Graduate  36149
1                            286      3  Graduate    133

Likley worth dropping to reduce dimensions as a similar percetage of each is manifest, let alone the negligible amount to observein the first place.

In [74]:
i = 16
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

debtor
0    0.928618
1    0.071382
Name: proportion, dtype: float64

        count unique       top   freq
debtor
0       71056      3  Graduate  35652
1        5462      3   Dropout   4179

Seemingly in debt, I suppose active debt as likely many are taking on student loans. Hence, notice the 'typical' trend without debt; with, however, has an approx. 80% dropout rate. Likely, this feature is related to stress, time, etc...

In [75]:
i = 17
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

tuition_fees_up_to_date
1    0.893646
0    0.106354
Name: proportion, dtype: float64

                         count unique       top   freq
tuition_fees_up_to_date
1                        68380      3  Graduate  36152
0                         8138      3   Dropout   7645

Similar to the previous one. Interestingly, this one is even more skewed with an almost 94% dropout rate... Hmm, for kicks:

In [80]:
#Hmm, this could be useful. Can tweak this, but For now...

focus1, focus2 = 'tuition_fees_up_to_date', 'debtor'
both = df[(df[focus1]==0)&(df[focus2]==1)].shape[0]
rest = df[df[focus1]==0].shape[0] + df[df[focus2]==1].shape[0] - both

print(f"{both} are unique to both {focus1} and {focus2}.")
print(f"Meanwhile, a total of {rest} are unique to one of the two features' conditions.")
#Hmm, that'd leave us

3468 are unique to both tuition_fees_up_to_date and debtor.
Meanwhile, a total of 10132 are unique to one of the two features' conditions.

In [81]:
i = 18
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

gender
0    0.684179
1    0.315821
Name: proportion, dtype: float64

        count unique       top   freq
gender
0       52352      3  Graduate  30232
1       24166      3   Dropout  12980

Wow, quite a lot more females. Recall the education discussion earlier. Furthermoe, notice that males will unfortunately drop out.

In [82]:
i = 19
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

scholarship_holder
0    0.752607
1    0.247393
Name: proportion, dtype: float64

                    count unique       top   freq
scholarship_holder
0                   57588      3   Dropout  23947
1                   18930      3  Graduate  15590

In [83]:
df[df['target']=='Graduate'].shape[0]

36282

Hmm, I'm unsure how expensive schooling is (see earlier discussion with debt) but wow.... Then again, observe the following

In [ ]:
i = 20
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

In [ ]:
i = 20
print(df[df.columns[i]].value_counts(normalize=True)[:6])
grouped = df.groupby(df.columns[i]).size().sort_values(ascending=False)
df.groupby(df.columns[i])['target'].describe().loc[grouped.index][:6]

In [10]:
df.head()

,id,marital_status,application_mode,application_order,course,daytime/evening_attendance,previous_qualification,previous_qualification_(grade),nacionality,mother's_qualification,...,curricular_units_2nd_sem_(credited),curricular_units_2nd_sem_(enrolled),curricular_units_2nd_sem_(evaluations),curricular_units_2nd_sem_(approved),curricular_units_2nd_sem_(grade),curricular_units_2nd_sem_(without_evaluations),unemployment_rate,inflation_rate,gdp,target
0,0,1,1,1,9238,1,1,126.0,1,1,...,0,6,7,6,12.428571,0,11.1,0.6,2.02,Graduate
1,1,1,17,1,9238,1,1,125.0,1,19,...,0,6,9,0,0.000000,0,11.1,0.6,2.02,Dropout
2,2,1,17,2,9254,1,1,137.0,1,3,...,0,6,0,0,0.000000,0,16.2,0.3,-0.92,Dropout
3,3,1,1,3,9500,1,1,131.0,1,19,...,0,8,11,7,12.820000,0,11.1,0.6,2.02,Enrolled
4,4,1,1,2,9500,1,1,132.0,1,19,...,0,7,12,6,12.933333,0,7.6,2.6,0.32,Graduate